Tekla.Structures.Drawing.View.ViewShorteningAttributes.#ctor(System.Boolean,System.Boolean,System.Double,System.Double)
Creates a new view shortening attributes instance with the given parameters.
CutParts: A value indicating whether cut parts are enabled.
CutSkewParts: A value indicating whether cut skewed parts are enabled.
MinimumLength: The minimum cut part length.
Offset: The space between the cut parts.